# WAVES

In [1]:
import pyodbc
import pandas as pd

In [2]:
cnxn = pyodbc.connect("Driver={ODBC Driver 17 for SQL Server};"
                        "Server=wd02;"
                        "Database=FootPrint;"
                        "UID=WOODFIELD\\jmeza@wdsrx.com;"
                        "PWD=Clavezaza2022;"
                        "Trusted_Connection=yes;")

### Query

In [3]:
df = pd.read_sql_query("SELECT CONVERT(varchar,w.releaseDate,100) Date, w.id, wa.name Warehouse, s.lookupCode Shipments, p.name Customer, ss.name ShipmentStatus\
    FROM datex_footprint.Waves w\
    JOIN datex_footprint.WaveStatuses ws\
        ON ws.id = w.statusId\
    JOIN datex_footprint.Warehouses wa\
        ON wa.id = w.warehouseId\
    JOIN datex_footprint.shipments s\
        ON s.waveId = w.id\
    JOIN datex_footprint.ShipmentOrderLookup sol\
        ON sol.shipmentId = s.id\
    JOIN datex_footprint.Orders o\
        ON o.id = sol.orderId\
    JOIN datex_footprint.Projects p\
        ON p.id = o.projectId\
    JOIN datex_footprint.ShipmentStatuses ss\
        ON ss.id = s.statusId\
    WHERE releaseDate > dateadd(day,-1,getdate())\
        AND w.statusId = 3\
    ORDER BY releaseDate DESC", cnxn)

# Create Waves Table Data

In [4]:
df.head(10)

,Date,id,Warehouse,Shipments,Customer,ShipmentStatus
0,Feb 21 2023 8:30AM,257783,10,0086408824,ISDIN Corporation,Released
1,Feb 21 2023 8:30AM,257783,10,0086408836,ISDIN Corporation,Released
2,Feb 21 2023 8:30AM,257783,10,0086412812,ISDIN Corporation,Released
3,Feb 21 2023 8:30AM,257784,10,0086414578,ISDIN Corporation,Released
4,Feb 21 2023 8:30AM,257784,10,0086414586,ISDIN Corporation,Released
5,Feb 21 2023 8:30AM,257783,10,0086408795,ISDIN Corporation,Released
6,Feb 21 2023 8:30AM,257783,10,0086408799,ISDIN Corporation,Released
7,Feb 21 2023 8:30AM,257783,10,0086408800,ISDIN Corporation,Released
8,Feb 21 2023 8:30AM,257783,10,0086408811,ISDIN Corporation,Released
9,Feb 21 2023 8:30AM,257783,10,0086408812,ISDIN Corporation,Released

In [5]:
# Count Shipments per Wave and Status
count_shipments_statusdf = df.groupby(['id', 'ShipmentStatus']).count()[['Shipments']]
count_shipments_statusdf.reset_index(inplace=True)
count_shipments_statusdf.tail()

        id ShipmentStatus  Shipments
31  257790       Released          1
32  257792       Released          1
33  257793       Released          6
34  257794       Released         22
35  257796       Released          1

In [6]:
# Convert Statuses to Columns
shipment_pivot = count_shipments_statusdf.pivot(index='id', columns='ShipmentStatus', values='Shipments')
shipment_pivot.tail()

ShipmentStatus  Completed  Executing  Released
id
257790                NaN        NaN       1.0
257792                NaN        NaN       1.0
257793                NaN        NaN       6.0
257794                NaN        NaN      22.0
257796                NaN        NaN       1.0

In [7]:
# Convert NaN to 0
shipment_pivot = shipment_pivot.fillna(0)
shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
257690                0.0        0.0       1.0
257705                1.0        3.0      18.0
257711                0.0        1.0      52.0
257713                0.0        0.0      37.0
257715                0.0        0.0      56.0

In [8]:
# Convert Float to Int
try:
    shipment_pivot['Completed'] = shipment_pivot['Completed'].astype(int)
except:
    print('Column Completed does not exist yet')

try:
    shipment_pivot['Executing'] = shipment_pivot['Executing'].astype(int)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'] = shipment_pivot['Released'].astype(int)
except:
    print('Column Released does not exist yet')

shipment_pivot.head()

ShipmentStatus  Completed  Executing  Released
id
257690                  0          0         1
257705                  1          3        18
257711                  0          1        52
257713                  0          0        37
257715                  0          0        56

In [9]:
# Convert id index to a column
shipment_pivot.reset_index(inplace=True)
shipment_pivot.head()

ShipmentStatus      id  Completed  Executing  Released
0               257690          0          0         1
1               257705          1          3        18
2               257711          0          1        52
3               257713          0          0        37
4               257715          0          0        56

In [10]:
# Convert zeros to blanks. This also change the data type to String
try:
    shipment_pivot['Completed'].replace([0, ''], '', inplace=True)
except:
    print('Column Completed does not exist yet')
    
try:
    shipment_pivot['Executing'].replace([0, ''], '', inplace=True)
except:
    print('Column Executing does not exist yet')

try:
    shipment_pivot['Released'].replace([0, ''], '', inplace=True)
except:
    print('Column Released does not exist yet')
    
shipment_pivot.head()

ShipmentStatus      id Completed Executing Released
0               257690                            1
1               257705         1         3       18
2               257711                   1       52
3               257713                           37
4               257715                           56

In [11]:
shipment_pivot.dtypes

ShipmentStatus
id            int64
Completed    object
Executing    object
Released     object
dtype: object

In [12]:
# Change columns order
df = df[['Date', 'id', 'Warehouse', 'Customer']]

In [13]:
# Drops duplicates
df = df.drop_duplicates()

In [14]:
df.head(10)

                    Date      id Warehouse                  Customer
0    Feb 21 2023  8:30AM  257783        10         ISDIN Corporation
3    Feb 21 2023  8:30AM  257784        10         ISDIN Corporation
11   Feb 21 2023  8:30AM  257782        10         ISDIN Corporation
70   Feb 21 2023  8:30AM  257778        10  Senseonics, Incorporated
71   Feb 21 2023  8:30AM  257786        10            Citieffe, Inc.
72   Feb 21 2023  7:52AM  257796        19        Opus Life Sciences
73   Feb 21 2023  7:45AM  257794        19       AdvaGen Pharma, Ltd
95   Feb 21 2023  7:30AM  257793        20            Exact-Rx, Inc.
101  Feb 21 2023  7:03AM  257792        22         NBTY Global, Inc.
102  Feb 20 2023  5:06PM  257790        16            Virtue Rx, LLC

In [15]:
# Merge df with pivot table
df2 = df.merge(shipment_pivot, left_on='id', right_on='id')
df2.head(10)

,Date,id,Warehouse,Customer,Completed,Executing,Released
0,Feb 21 2023 8:30AM,257783,10,ISDIN Corporation,,,10
1,Feb 21 2023 8:30AM,257784,10,ISDIN Corporation,,,2
2,Feb 21 2023 8:30AM,257782,10,ISDIN Corporation,,,58
3,Feb 21 2023 8:30AM,257778,10,"Senseonics, Incorporated",,,1
4,Feb 21 2023 8:30AM,257786,10,"Citieffe, Inc.",,,1
5,Feb 21 2023 7:52AM,257796,19,Opus Life Sciences,,,1
6,Feb 21 2023 7:45AM,257794,19,"AdvaGen Pharma, Ltd",,,22
7,Feb 21 2023 7:30AM,257793,20,"Exact-Rx, Inc.",,,6
8,Feb 21 2023 7:03AM,257792,22,"NBTY Global, Inc.",,,1
9,Feb 20 2023 5:06PM,257790,16,"Virtue Rx, LLC",,,1

In [16]:
wave_df = pd.DataFrame()
statuses = list(df2.columns)

# Reorder columns
if ('Released' in statuses) and ('Executing' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing', 'Completed']]
elif ('Released' in statuses) and ('Executing' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Executing']]
elif ('Released' in statuses) and ('Completed' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released', 'Completed']]
elif ('Released' in statuses):
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer', 'Released']]
else:
    wave_df = df2[['Date', 'id', 'Warehouse', 'Customer']]

In [17]:
wave_df.head(10)

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Feb 21 2023 8:30AM,257783,10,ISDIN Corporation,10,,
1,Feb 21 2023 8:30AM,257784,10,ISDIN Corporation,2,,
2,Feb 21 2023 8:30AM,257782,10,ISDIN Corporation,58,,
3,Feb 21 2023 8:30AM,257778,10,"Senseonics, Incorporated",1,,
4,Feb 21 2023 8:30AM,257786,10,"Citieffe, Inc.",1,,
5,Feb 21 2023 7:52AM,257796,19,Opus Life Sciences,1,,
6,Feb 21 2023 7:45AM,257794,19,"AdvaGen Pharma, Ltd",22,,
7,Feb 21 2023 7:30AM,257793,20,"Exact-Rx, Inc.",6,,
8,Feb 21 2023 7:03AM,257792,22,"NBTY Global, Inc.",1,,
9,Feb 20 2023 5:06PM,257790,16,"Virtue Rx, LLC",1,,

In [18]:
# Save Waves DF into json file
wave_df.to_json('data/waves.json')

# Warehouse Pie Chart Data

In [19]:
# Save df2 in df3
warehouse_df = wave_df
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Feb 21 2023 8:30AM,257783,10,ISDIN Corporation,10,,
1,Feb 21 2023 8:30AM,257784,10,ISDIN Corporation,2,,
2,Feb 21 2023 8:30AM,257782,10,ISDIN Corporation,58,,
3,Feb 21 2023 8:30AM,257778,10,"Senseonics, Incorporated",1,,
4,Feb 21 2023 8:30AM,257786,10,"Citieffe, Inc.",1,,

In [20]:
# Conver String to Float
try:
    warehouse_df['Released'] = pd.to_numeric(warehouse_df['Released'],errors='coerce')
except:
    print('Column Released does not exist yet')

try:
    warehouse_df['Executing'] = pd.to_numeric(warehouse_df['Executing'],errors='coerce')
except:
    print('Column Executing does not exist yet')

try:
    warehouse_df['Completed'] = pd.to_numeric(warehouse_df['Completed'],errors='coerce')
except:
    print('Column Completed does not exist yet')

warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Feb 21 2023 8:30AM,257783,10,ISDIN Corporation,10.0,NaN,NaN
1,Feb 21 2023 8:30AM,257784,10,ISDIN Corporation,2.0,NaN,NaN
2,Feb 21 2023 8:30AM,257782,10,ISDIN Corporation,58.0,NaN,NaN
3,Feb 21 2023 8:30AM,257778,10,"Senseonics, Incorporated",1.0,NaN,NaN
4,Feb 21 2023 8:30AM,257786,10,"Citieffe, Inc.",1.0,NaN,NaN

In [21]:
# Conver NaN to Zero
warehouse_df = warehouse_df.fillna(0)
warehouse_df.head()

,Date,id,Warehouse,Customer,Released,Executing,Completed
0,Feb 21 2023 8:30AM,257783,10,ISDIN Corporation,10.0,0.0,0.0
1,Feb 21 2023 8:30AM,257784,10,ISDIN Corporation,2.0,0.0,0.0
2,Feb 21 2023 8:30AM,257782,10,ISDIN Corporation,58.0,0.0,0.0
3,Feb 21 2023 8:30AM,257778,10,"Senseonics, Incorporated",1.0,0.0,0.0
4,Feb 21 2023 8:30AM,257786,10,"Citieffe, Inc.",1.0,0.0,0.0

In [22]:
# Group by Warehouse
warehouse_df = warehouse_df.groupby(['Warehouse']).sum()
warehouse_df

                id  Released  Executing  Completed
Warehouse
10         6443546     401.0       49.0        5.0
16          515532       1.0        1.0        0.0
19          515590      23.0        0.0        0.0
20          257793       6.0        0.0        0.0
22          257792       1.0        0.0        0.0

In [23]:
# Reset Index
warehouse_df.reset_index(inplace=True)
warehouse_df

  Warehouse       id  Released  Executing  Completed
0        10  6443546     401.0       49.0        5.0
1        16   515532       1.0        1.0        0.0
2        19   515590      23.0        0.0        0.0
3        20   257793       6.0        0.0        0.0
4        22   257792       1.0        0.0        0.0

In [24]:
warehouses = list(warehouse_df.columns)
warehouse_df2 = pd.DataFrame()

if ('Released' in warehouses) and ('Executing' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing', 'Completed']]
elif ('Released' in warehouses) and ('Executing' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Executing']]
elif ('Released' in warehouses) and ('Completed' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released', 'Completed']]
elif ('Released' in warehouses):
    warehouse_df2 = warehouse_df[['Warehouse', 'Released']]
else:
    warehouse_df2 = warehouse_df[['Warehouse']]

warehouse_df2

  Warehouse  Released  Executing  Completed
0        10     401.0       49.0        5.0
1        16       1.0        1.0        0.0
2        19      23.0        0.0        0.0
3        20       6.0        0.0        0.0
4        22       1.0        0.0        0.0

In [25]:
warehouse_df2 = pd.melt(warehouse_df2, id_vars=["Warehouse"], 
                  var_name="Status", value_name="Value")
warehouse_df2.head()

  Warehouse    Status  Value
0        10  Released  401.0
1        16  Released    1.0
2        19  Released   23.0
3        20  Released    6.0
4        22  Released    1.0

In [26]:
warehouse_df3 = warehouse_df2.pivot(index ='Status', columns='Warehouse', values='Value')
warehouse_df3

Warehouse     10   16    19   20   22
Status
Completed    5.0  0.0   0.0  0.0  0.0
Executing   49.0  1.0   0.0  0.0  0.0
Released   401.0  1.0  23.0  6.0  1.0

In [27]:
warehouse_df4 = warehouse_df3.reset_index()
warehouse_df4

Warehouse     Status     10   16    19   20   22
0          Completed    5.0  0.0   0.0  0.0  0.0
1          Executing   49.0  1.0   0.0  0.0  0.0
2           Released  401.0  1.0  23.0  6.0  1.0

In [28]:
warehouse_df4 = warehouse_df4.rename_axis(None, axis=1)
warehouse_df4

      Status     10   16    19   20   22
0  Completed    5.0  0.0   0.0  0.0  0.0
1  Executing   49.0  1.0   0.0  0.0  0.0
2   Released  401.0  1.0  23.0  6.0  1.0

In [29]:
# Save Warehouse into JSON file
warehouse_df4.to_json('data/warehouse.json')

In [30]:
# Close connection
cnxn.close()